<a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>

In [1]:
import pandas as pd
import numpy as np

# Apply

In [2]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df['total'] = df['midterm'] + df['final']
df['average'] = df['total'] / 2
grades = []

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    elif row >= 70:
        grades.append('C')
    else:
        grades.append('F')
        
df['grade'] = grades
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       10     30     40     20.0     F

## 1. 사용할 함수를 정의한다.

In [3]:
def pass_or_fail(row):
    print(row)
    if row != "F":
        return 'Pass'
    else:
        return 'Fail'

## `df[저장할 컬럼] = df.적용할컬럼.apply(함수)`

In [4]:
df['result'] = df.grade.apply(pass_or_fail)
df

A
B
F

    name  midterm  final  total  average grade result
0   John       95     85    180     90.0     A   Pass
1  Jenny       85     80    165     82.5     B   Pass
2   Nate       10     30     40     20.0     F   Fail

In [5]:
date_list = [{'yyyy-mm-dd': '1999-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  1999-06-27
1  2002-09-24
2  2005-12-20

In [6]:
def extract_year(row):
    return row.split('-')[0]
df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  1999-06-27  1999
1  2002-09-24  2002
2  2005-12-20  2005

## apply 함수에 파라미터 전달하기
* 키워드 파라미터를 사용하시면, apply가 적용된 함수에 파라미터를 전달 하실 수 있습니다.

In [7]:
def extract_age(year, current_year):
    return current_year -int(year)

In [8]:
df['age'] = df['year'].apply(extract_age, current_year=2018)
df

   yyyy-mm-dd  year  age
0  1999-06-27  1999   19
1  2002-09-24  2002   16
2  2005-12-20  2005   13

## lambda 활용 하기

In [9]:
df['year2'] = df['yyyy-mm-dd'].apply(lambda x : x.split('-')[0] )
df

   yyyy-mm-dd  year  age year2
0  1999-06-27  1999   19  1999
1  2002-09-24  2002   16  2002
2  2005-12-20  2005   13  2005

In [10]:
df['C'] = df['yyyy-mm-dd'].apply(lambda x : '19C' if int(x.split('-')[0]) <= 1999 else '20C')
df

   yyyy-mm-dd  year  age year2    C
0  1999-06-27  1999   19  1999  19C
1  2002-09-24  2002   16  2002  20C
2  2005-12-20  2005   13  2005  20C

## apply 함수에 한 개 이상의 파라미터 전달하기
* 키워드 파라미터를 추가해주시면, 원하시는만큼의 파라미터를 함수에 전달 가능합니다.

In [11]:
def get_introduce(age, prefix, suffix):
    return prefix + str(age) + suffix

df['introduce'] = df['age'].apply(get_introduce, prefix="I am ", suffix=" years old")
df

   yyyy-mm-dd  year  age year2    C          introduce
0  1999-06-27  1999   19  1999  19C  I am 19 years old
1  2002-09-24  2002   16  2002  20C  I am 16 years old
2  2005-12-20  2005   13  2005  20C  I am 13 years old

## 여러개의 컬럼을 동시에 전달하기

* **`axis = 1`** 이라는 키워드 파라미터를 apply 함수에 전달해주면, 모든 컬럼을 지정된 함수에서 사용 가능합니다.

In [12]:
date_list = [{'yyyy-mm-dd': '1999-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df['year'] = df['yyyy-mm-dd'].apply(lambda x : x[:4])
df['age'] = df['year'].apply(extract_age, current_year=2018)
df

   yyyy-mm-dd  year  age
0  1999-06-27  1999   19
1  2002-09-24  2002   16
2  2005-12-20  2005   13

In [13]:
def get_introduce2(row):
    return "I was born in "+str(row.year)+" my age is "+str(row.age)

df['introduce'] = df.apply(get_introduce2, axis=1)
df

   yyyy-mm-dd  year  age                        introduce
0  1999-06-27  1999   19  I was born in 1999 my age is 19
1  2002-09-24  2002   16  I was born in 2002 my age is 16
2  2005-12-20  2005   13  I was born in 2005 my age is 13

## Map 함수로 컬럼 추가 및 변경하기
파라미터로 함수를 전달하면 apply 함수와 동일하게 컬럼값을 추가 및 변경할 수 있습니다

In [14]:
def extract_year(row):
    return row.split('-')[0]

date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [15]:
df['year'] = df['yyyy-mm-dd'].map(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

파라미터로 딕셔너리를 전달하면 컬럼값을 쉽게 원하는 값으로 변경 가능합니다.   

기존의 컬럼값은 딕셔너리의 key로 사용되고, 해당되는 value의 값으로 컬럼값이 변경됩니다.

In [16]:
job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [17]:
df.job = df.job.map({"student":1,"developer":2,"teacher":3})
df

   age  job
0   20    1
1   30    2
2   30    3

## Applymap
데이터프레임 전체의 각각의 값을 한번에 변경시키실 때 사용하시면 좋습니다.

In [18]:
x_y = [{'x': 5.5, 'y': -5.6},
         {'x': -5.2, 'y': 5.5},
         {'x': -1.6, 'y': -4.5}]
df = pd.DataFrame(x_y)
df

     x    y
0  5.5 -5.6
1 -5.2  5.5
2 -1.6 -4.5

In [19]:
df = df.applymap(np.around)
df

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0

# Drill

## 카테고리 만들기

###### 타이타닉 나이별로 카테고리화 하기

In [20]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')
df.dropna(axis=0, inplace=True)
df.age.isnull().sum()
df_age = pd.DataFrame(df.age)
df_age.head(3)

    age
1  38.0
3  35.0
6  54.0

In [21]:
# 나이에 따라 세분화된 분류를 수행하는 함수 생성

def get_category(age):
    cat = ''
    if age <=5: cat = 'Baby'
    elif age <= 18: cat = 'Child'
    elif age <= 25: cat = 'Teenager'
    elif age <= 36: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else: cat = 'Elderly'
    
    return cat

In [22]:
df_age.columns

Index(['age'], dtype='object')

In [23]:
df_age['Age_cat'] = df_age['age'].apply(lambda x : get_category(x))
df_age.head(13)

     age      Age_cat
1   38.0        Adult
3   35.0  Young Adult
6   54.0        Adult
10   4.0         Baby
11  58.0        Adult
21  34.0  Young Adult
23  28.0  Young Adult
27  19.0     Teenager
52  49.0        Adult
54  65.0      Elderly
62  45.0        Adult
66  29.0  Young Adult
75  25.0     Teenager

## 중복된 컬럼 명 바꾸기

* 컬럼 명이 중복 되어 있지만, 의미가 있을때 _n 꼴로 추가해서 바꾸는 방법

In [27]:
col_name_l = ['A','B','C','D']*10 + ['F'] + ['A','B']*10

feature_name_df = pd.DataFrame({'col_name':col_name_l})
feature_name_df.value_counts()

col_name
B           20
A           20
D           10
C           10
F            1
dtype: int64

* apply 를 적을때 axis=1 은 상당히 중요한 요소이다.

In [43]:
def get_new_feature_name(col_name_l):
    f_n_df = pd.DataFrame({'col_name':col_name_l})
    f_n_df['cnt'] = f_n_df.groupby('col_name').cumcount() # 누적 count 함수 groupby 집계 함수와만 쓰인다.
    print(f_n_df.info())
    f_n_df['col_name'] = f_n_df[['col_name','cnt']].apply(lambda x: x[0]+ '_' +str(x[1]) if x[1] > 1 else x[0], axis=1)
    f_n_df.drop('cnt',axis=1 , inplace=True)
    return f_n_df['col_name'].values.tolist()

In [44]:
col_name_l = ['A','B','C','D']*10 + ['F'] + ['A','B']*10
new_col_name_l = get_new_feature_name(col_name_l)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61 entries, 0 to 60
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   col_name  61 non-null     object
 1   cnt       61 non-null     int64
dtypes: int64(1), object(1)
memory usage: 1.1+ KB
None

In [46]:
for i in new_col_name_l:
    print(i, end='\t')

A	B	C	D	A	B	C	D	A_2	B_2	C_2	D_2	A_3	B_3	C_3	D_3	A_4	B_4	C_4	D_4	A_5	B_5	C_5	D_5	A_6	B_6	C_6	D_6	A_7	B_7	C_7	D_7	A_8	B_8	C_8	D_8	A_9	B_9	C_9	D_9	F	A_10	B_10	A_11	B_11	A_12	B_12	A_13	B_13	A_14	B_14	A_15	B_15	A_16	B_16	A_17	B_17	A_18	B_18	A_19	B_19

Apply 는 중요한대 너무 어렵다...

밑에 2 site로 drill 해주세요~

https://data-newbie.tistory.com/207

http://www.leejungmin.org/post/2018/04/21/pandas_apply_and_map/

출처: 
* <a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>


<br>


* [이수안컴퓨터연구소](https://www.youtube.com/channel/UCFfALXX0DOx7zv6VeR5U_Bg)
* https://github.com/minsuk-heo/pandas